[String]
IDS_MENU_PROJECT      = 工程
IDS_MENU_PROJECT_NEW  = 新建工程
IDS_MENU_PROJECT_OPEN = 打開工程
IDS_MENU_PROJECT_SAVE = 保存工程
IDS_MENU_EXIT         = 退出

IDS_MENU_FILE         = 文件
IDS_MENU_FILE_ADD     = 添加文件
IDS_MENU_FILE_MODIFY  = 編輯文件路徑
IDS_MENU_FILE_REMOVE  = 移除文件

IDS_MENU_PROTECT      = 保護
IDS_MENU_PROTECT_CUR  = 保護當前文件
IDS_MENU_PROTECT_ALL  = 保護全部文件

IDS_MENU_LANG         = 語言

IDS_MENU_VIEW         = 視圖
IDS_MENU_VIEW_TOOL    = 工具欄
IDS_MENU_VIEW_STATUS  = 狀態欄

IDS_MENU_HELP         = 幫助
IDS_MENU_HELP_ABOUT   = 關於

IDS_STATUS_PROJECT_NEW  = 創建一個新的工程
IDS_STATUS_PROJECT_OPEN = 打開已有的工程文件
IDS_STATUS_PROJECT_SAVE = 保存工程
IDS_STATUS_EXIT         = 退出本程序
IDS_STATUS_FILE_ADD     = 添加要保護的文件
IDS_STATUS_FILE_MODIFY  = 修改文件的路徑
IDS_STATUS_FILE_REMOVE  = 從列表中移除文件
IDS_STATUS_PROTECT_CUR  = 保護當前文件
IDS_STATUS_PROTECT_ALL  = 保護全部文件
IDS_STATUS_VIEW_TOOL    = 顯示或隱藏工具欄
IDS_STATUS_VIEW_STATUS  = 顯示或隱藏狀態欄
IDS_STATUS_ABOUT        = 查看本程序的版本與版權等信息

IDS_MAINFRM_ERRTITLE           = 錯誤
IDS_MAINFRM_HADRUN             = 程序已經在運行了!
IDS_MAINFRM_STR1               = 程序運行缺少必要的文件!
IDS_MAINFRM_STR2               = 調用加殼進程失敗!
IDS_MAINFRM_UNSUPPORT_WIN32PE  = 當前加密鎖不支持Win32PE程序加殼
IDS_MAINFRM_UNSUPPORT_WIN64PE  = 當前加密鎖不支持Win64PE程序加殼
IDS_MAINFRM_UNSUPPORT_WIN32NET = 當前加密鎖不支持Win32 .NET程序加殼
IDS_MAINFRM_UNSUPPORT_WIN64NET = 當前加密鎖不支持Win64 .NET程序加殼
IDS_MAINFRM_PACKED             = 此程序可能已被加過殼, 再次加殼可能導致不能運行

IDS_LISTVIEW_COLUMN_1   = 序號
IDS_LISTVIEW_COLUMN_2   = 類型
IDS_LISTVIEW_COLUMN_3   = 輸入文件
IDS_LISTVIEW_COLUMN_4   = 輸出文件
IDS_LISTVIEW_COLUMN_5   = 結果
IDS_LISTVIEW_STR1       = 成功
IDS_LISTVIEW_STR2       = 失敗
IDS_LISTVIEW_WIN32PE      = PE32
IDS_LISTVIEW_WIN64PE      = PE64
IDS_LISTVIEW_WIN32DOTNET  = .Net32
IDS_LISTVIEW_WIN64DOTNET  = .Net64
IDS_LISTVIEW_WIN32DP_DATA = DATA32
IDS_LISTVIEW_WIN64DP_DATA = DATA64

IDS_DIALOG_TYPE_TITLE      = 類型選擇
IDS_DIALOG_TYPE_STR1       = 請選擇所用的加密鎖類型
IDS_DIALOG_DONGLE_ET99     = ET99、ET99 Time、ET299
IDS_DIALOG_DONGLE_ET199    = ET199
IDS_DIALOG_TYPE_BTN_OK     = 確定
IDS_DIALOG_TYPE_BTN_CANCEL = 取消

IDS_DIALOG_FILE_TITLE        = 文件路徑
IDS_DIALOG_FILE_STR1         = 輸入文件:
IDS_DIALOG_FILE_STR2         = 輸出文件:
IDS_DIALOG_FILE_STR3         = 要保護的文件類型:
IDS_DIALOG_FILE_STR4         = 錯誤
IDS_DIALOG_FILE_STR5         = 請輸入待加殼文件的路徑
IDS_DIALOG_FILE_STR6         = 請輸入加殼後的文件保存的路徑
IDS_DIALOG_FILE_STR7         = 程序
IDS_DIALOG_FILE_STR8         = 數據
IDS_DIALOG_FILE_BTN_OK       = 確定
IDS_DIALOG_FILE_BTN_CANCEL   = 取消

IDS_DIALOG_METHOD_TITLE        = 選擇需要加密的函數
IDS_DIALOG_METHOD_BTN_OK       = 確定
IDS_DIALOG_METHOD_BTN_CANCEL   = 取消
IDS_DIALOG_METHOD_ERR1         = 您必須至少選擇一個方法進行加密
 
IDS_DIALOG_ABOUT_TITLE     = 關  於
IDS_DIALOG_ABOUT_STR1      = 產  品:
IDS_DIALOG_ABOUT_STR2      = 版  本:
IDS_DIALOG_ABOUT_STR3      = 公  司:
IDS_DIALOG_ABOUT_STR4      = 網  站:
IDS_DIALOG_ABOUT_STR5      = 外殼保護中心

IDS_SHELLOPTION_PE_TITLE      = PE 外殼選項
IDS_SHELLOPTION_PE_ITEM1      = 反調試
IDS_SHELLOPTION_PE_DESC1      = 是否啟用外殼的反調試功能
IDS_SHELLOPTION_PE_ITEM2      = 檢查父進程
IDS_SHELLOPTION_PE_DESC2      = 是否啟用外殼的父進程檢查
IDS_SHELLOPTION_PE_ITEM3      = 指令替換
IDS_SHELLOPTION_PE_DESC3      = 是否啟用外殼的指令替換功能，以增加外殼的強度
IDS_SHELLOPTION_PE_ITEM4      = 啟用數據文件保護
IDS_SHELLOPTION_PE_DESC4      = 是否啟用外殼的數據文件保護功能
IDS_SHELLOPTION_YES           = 是
IDS_SHELLOPTION_NO            = 否

IDS_SHELLOPTION_NET_TITLE     = .NET 外殼選項
IDS_SHELLOPTION_NET_ITEM1     = 算法選擇
IDS_SHELLOPTION_NET_DESC1     = 請選擇相應的加密算法
IDS_SHELLOPTION_NET_ITEM2     = 重置強名稱
IDS_SHELLOPTION_NET_DESC2     = 是否重置強名稱
IDS_SHELLOPTION_NET_ITEM3     = 創建新的強文件
IDS_SHELLOPTION_NET_DESC3     = 是否創建新的強文件
IDS_SHELLOPTION_NET_ITEM4     = 強文件名
IDS_SHELLOPTION_NET_DESC4     = 請輸入強文件名
IDS_SHELLOPTION_NET_ITEM5     = 加密BLOB數據
IDS_SHELLOPTION_NET_DESC5     = 是否加密BLOB數據
IDS_SHELLOPTION_NET_ITEM6     = 加密字符串
IDS_SHELLOPTION_NET_DESC6     = 是否加密字符串
IDS_SHELLOPTION_NET_ITEM7     = 加密資源段
IDS_SHELLOPTION_NET_DESC7	    = 是否加密資源段
IDS_SHELLOPTION_NET_ITEM8     = 加密方法體
IDS_SHELLOPTION_NET_DESC8	    = 是否加密方法體
IDS_SHELLOPTION_NET_ITEM9     = 方法列表
IDS_SHELLOPTION_NET_DESC9     = 點擊右邊的按鈕可選擇所需加密的方法
IDS_SHELLOPTION_NET_ENCALL    = 全部加密
IDS_SHELLOPTION_NET_ENCSOME   = 部分加密
IDS_SHELLOPTION_NET_ENCNOTHING= 未加密

IDS_SHELLOPTION_DPD_TITLE     = 數據保護選項
IDS_SHELLOPTION_DPD_ITEM1     = 算法選擇
IDS_SHELLOPTION_DPD_DESC1     = 請選擇相應的加密算法
IDS_SHELLOPTION_DPD_ITEM2     = 平臺選擇
IDS_SHELLOPTION_DPD_DESC2     = 請選擇此數據文件被調用的平臺

IDS_ET99_MSG_TITLE   = 錯誤
IDS_ET99_MSG_NOKEY   = 找不到指定的加密鎖
IDS_ET99_MSG_PINERR  = 加密鎖用戶PIN碼校驗失敗
IDS_ET99_MSG_EXPIRE  = 加密鎖時間授權已過期
IDS_ET99_MSG_RTCSTOP = 加密鎖內實時鍾已停走
IDS_ET99_NAME_1      = 產品ID
IDS_ET99_DESC_1      = 請輸入加密鎖的產品ID,即PID
IDS_ET99_NAME_2      = 用戶PIN碼
IDS_ET99_DESC_2      = 請輸入加密鎖的用戶PIN碼,加殼後請勿更改,否則會導致加殼後的程序不能運行
IDS_ET99_NAME_3      = 綁定HID
IDS_ET99_DESC_3      = 是否綁定加密鎖的硬件ID
IDS_ET99_NAME_4      = HID
IDS_ET99_DESC_4      = 請輸入要綁定的鎖硬件ID
IDS_ET99_NAME_5      = 啟用後臺定時檢測
IDS_ET99_DESC_5      = 是否啟用加密鎖後臺定時檢測
IDS_ET99_NAME_6      = 時間間隔(秒)
IDS_ET99_DESC_6      = 請輸入後臺定時檢測的周期,單位是秒
IDS_ET99_NAME_7      = 信息標題
IDS_ET99_DESC_7      = 請輸入錯誤提示信息的標題
IDS_ET99_NAME_8      = 找不到鎖的提示信息
IDS_ET99_DESC_8      = 請輸入找不到加密鎖時的錯誤提示信息
IDS_ET99_NAME_9      = 用戶PIN碼校驗失敗的提示信息
IDS_ET99_DESC_9      = 加完殼之後請勿再更改加密鎖的用戶PIN碼,否則將導致此錯誤的發生
IDS_ET99_NAME_10     = 時間授權已過期的提示信息
IDS_ET99_DESC_10     = 請輸入時間授權過期時的錯誤提示信息
IDS_ET99_NAME_11     = 鎖內實時鍾已停走的提示信息
IDS_ET99_DESC_11     = 請輸入鎖內實時鍾因電池失效而停走的錯誤提示信息

IDS_ET199_MSG_TITLE   = 錯誤
IDS_ET199_MSG_NOKEY   = 找不到指定的加密鎖
IDS_ET199_NAME_1      = 客戶號
IDS_ET199_DESC_1      = 請輸入加密鎖的客戶號
IDS_ET199_NAME_2      = 綁定HID
IDS_ET199_DESC_2      = 是否綁定加密鎖的硬件ID
IDS_ET199_NAME_3      = HID
IDS_ET199_DESC_3      = 請輸入要綁定的鎖硬件ID
IDS_ET199_NAME_4      = 啟用後臺定時檢測
IDS_ET199_DESC_4      = 是否啟用加密鎖後臺定時檢測
IDS_ET199_NAME_5      = 時間間隔(秒)
IDS_ET199_DESC_5      = 請輸入後臺定時檢測的周期,單位是秒
IDS_ET199_NAME_6      = 信息標題
IDS_ET199_DESC_6      = 請輸入錯誤提示信息的標題
IDS_ET199_NAME_7      = 找不到鎖的提示信息 
IDS_ET199_DESC_7      = 請輸入找不到加密鎖時的錯誤提示信息

